/* The label on the Cancel button in the assertion-failure & throw alerts */
"Abort" = "Abort";

/* The default name for an undoable action. */
"Action" = "Action";

/* Menu item text that allows user to choose all files that can be read by the application. */
"All Readable Files" = "All Readable Files";

/* The message displayed in the assertion-failure alert */
"Assert Message" = "Condition: %1%\n\nFunction: %2%\nFile: %3%\nLine # %4%";

/* The title of the assertion-failure alert */
"Asssertion Failed" = "Asssertion Failed";

/* Error message when a property list file can't be read. */
"B::PropertyListCreateException" = "Can’t read property list file.";

/* Generic message when a bad-format-string exception occurs in the  boost format library. */
"boost::bad_format_string" = "Bad format string.";

/* Generic message when an exception occurs in the  boost format library. */
"boost::format_error" = "Unknown boost format error.";

/* Generic message when a out-of-range exception occurs in the  boost format library. */
"boost::out_of_range" = "Value out of range for format string.";

/* Generic message when a too-few-arguments exception occurs in the  boost format library. */
"boost::too_few_args" = "Too few arguments for format string.";

/* Generic message when a too-many-arguments exception occurs in the  boost format library. */
"boost::too_many_args" = "Too many arguments for format string.";

/* Displayed when there's nothing to redo */
"Can't Redo" = "Can’t Redo";

/* Displayed when there's nothing to undo */
"Can't Undo" = "Can’t Undo";

/* The label on the OK button in the assertion-failure & throw alerts */
"Continue" = "Continue";

/* The title of the exception-throwing debug alert */
"Exception Thrown" = "Exception Thrown";

/* The default accessibility description for Help buttons. */
"HelpButtonAXDescription" = "Help";

/* An error message describing an out-of-memory situation. */
"Out of memory" = "Out of memory";

/* The label on the Quiet button in the assertion-failure & throw alerts */
"Quiet" = "Quiet";

/* Generic 'Redo' menu item text */
"Redo" = "Redo";

/* Default 'Redo' menu item text when there's a specific action to redo.  %1% holds the name of the action */
"Redo %1%" = "Redo %1%";

/* Generic message when a domain exception occurs. */
"std::domain_error" = "Unknown domain error.";

/* Generic message when an exception occurs. */
"std::exception" = "Unknown error.";

/* Generic message when an invalid-argument exception occurs. */
"std::invalid_argument" = "Invalid argument.";

/* Generic message when an I/O exception occurs. */
"std::ios_base::failure" = "Input/Output error.";

/* Generic message when a length exception occurs. */
"std::length_error" = "Length exceeds maximum.";

/* Generic message when a logic exception occurs. */
"std::logic_error" = "Unknown logic error.";

/* Generic message when an out-of-range exception occurs. */
"std::out_of_range" = "Value out of range.";

/* Generic message when an overflow exception occurs. */
"std::overflow_error" = "Overflow error.";

/* Generic message when a range exception occurs. */
"std::range_error" = "Unknown range error.";

/* Generic message when a runtime exception occurs. */
"std::runtime_error" = "Unknown runtime error.";

/* Generic message when an underflow exception occurs. */
"std::underflow_error" = "Underflow error.";

/* The message displayed in the exception-throwing debug alert */
"Throw Message" = "Message: %1%\nWhat: %2%\nError: %3%\n\nFunction: %4%\nFile: %5%\nLine # %6%";

/* Generic 'Undo' menu item text */
"Undo" = "Undo";

/* Default 'Undo' menu item text when there's a specific action to undo.  %1% holds the name of the action */
"Undo %1%" = "Undo %1%";

/* An error message displayed when something went wrong but we don't know what. */
"Unknown exception" = "Unknown exception.";

/* the name of the untitled documents after the first */
"untitled %1%" = "untitled %1%";

/* the name of the first untitled document */
"untitled" = "untitled";
